import PoemCollection from '@/components/section/poem-collection';

export default function page() {
  const myPoems = [
    {
      id: 'poem1',
      title: 'सवाल',
      author: 'Your Name',
      content:
        'कहूं कि न कहूं, सवाल ही गलत है ।\n' +
        'क्या कहूं क्यों कहूं, मलाल ही गलत है ।\n' +
        'वक़्त ठहरता थोड़ा सा तो मैं भी इंतज़ार कर लेता\n' +
        'वो गुज़र जायेगा और मैं रहूँगा यहीं ये ख्याल ही गलत है ।\n\n' +
        'मुझसे कहे कोई कि सफर की हर बात तय कर लो\n' +
        'अब से क्या क्या होगा ये मय कर लो\n' +
        'जिसने तय किया मेरा सफर ये तो वो बताएगा\n' +
        'अगला पल क्या होगा मुझसे तो ये सवाल ही गलत है\n\n' +
        'किसी दिन उलझन में मेरा कसूर मत देखना\n' +
        'समझ में न आये उसकी कोई बात तो मेरा खत न फेंकना\n' +
        'लिखा जरूर मैंने एक जवाब\n' +
        'मगर उस जवाब का सवाल ठीक है ये सवाल ही गलत है ।\n\n' +
        'ये लगता तो जरूर है कि ये मेरी ग़ज़ल है\n' +
        'मगर मेरे पास बस एक सफा और एक कलम है\n' +
        'उसे है आदत बस यही मुझ पर शेर पढ़ देने की\n' +
        'मेरी तकदीर की तस्वीर मेरे पास है ये ख्याल ही गलत है।\n\n' +
        'रहमत से उसने मुझे इबादत देदी\n' +
        'हर बात पे हाथ फ़ैलाने सर झुकाने की आदत देदी\n' +
        'इरादा भी है मेरा वादा भी है\n' +
        'मगर मोहलत है वादा निभाने की ये सवाल ही गलत है।\n' +
        'मैं रहूँगा यहीं ये ख्याल ही गलत है।',
    },
    {
      id: 'poem2',
      title: 'पलों से पल मिलते हैं',
      author: 'Your Name',
      content:
        'आज परिंदे को मैंने वो जगह दिखाई\n' +
        'जहाँ हर पल मुझे मेरे पल मिलते हैं\n' +
        'सूरज कि किरणों को चांदनी के रंग में देखकर गुनगुना उठा पपीहा\n\n' +
        'ठहरा हुआ वक्त बस एक फिकरा नहीं\n' +
        'वो खुद हैरान है देखकर कि कैसे पलों से पल मिलते हैं\n\n' +
        'वो जो खनक है मुस्कराहट की जो उफ़क को महसूस हो\n' +
        'अब हमारी यादों में चल वहीँ चले जहाँ आज और कल मिलते हैं\n\n' +
        'कोई दूसरा जहाँ है सुना है जहाँ यहाँ होते हुए भी हम वहां होंगे\n' +
        'और सिर्फ परिंदों को पता होगा\n' +
        'कोई तो नक्शा दिखाता होगा जहाँ इस जहाँ के पलों से उस जहाँ के पल मिलते हैं\n\n' +
        'हवाओं से अभी अभी एक हल मिला है\n' +
        'जो वहां होकर आया है पल मिला है\n' +
        'कहता है यकीन रख उसके बनाये आज में\n' +
        'जो आज ये पल उसी का तो फिर उसके हर इस पल को कल उसीका पल मिलता है',
    },
    {
      id: '3',
      title: 'हिस्सा',
      author: 'Your Name',
      content:
        'तुमने ऐसा क्या सोचा मेरे बारे में जो मैं हिस्सा बन गया तुम्हारा\n' +
        'कोई बात ऐसी है मेरे बारे में जो मुझे पता नहीं है\n' +
        'कहीं नीले रंग में घुला मैं उसी बात को लेकर मिला तुमसे और हिस्सा बन गया तुम्हारा\n\n' +
        'तुमने देखा मुझे वहां जहाँ नहीं था मैं\n' +
        'साथ ले गए या बुलाया होगा उफ़क (क्षितिज) के पास\n' +
        'मगर कैसे जो मैं हिस्सा बन गया तुम्हारा\n\n' +
        'क्या बात हुई जो महसूस तो होती है मुझे मगर पता नहीं है।\n' +
        'वो उफ़क दिखाई पड़ा जो आईने में तुम्हे आँखों में\n' +
        'तो मालूम पड़ा के मैं हिस्सा बन गया तुम्हारा\n\n' +
        'बड़ा सुकून हुआ है उस हिस्से को देखकर अपने\n' +
        'मुझसे दूर मगर बहुत खुश है मेरा वो हिस्सा जो हिस्सा बन गया तुम्हारा\n\n' +
        'चलते चलते उसके साथ अपनी बातों में कभी\n' +
        'मुझे भी शामिल किया करो कि थोड़ा सा ही सही\n' +
        'वो मैं ही तो हूँ जो हिस्सा बन गया तुम्हारा',
    },
  ];
  return (
    <main className="flex min-h-screen  items-center justify-between">
      <PoemCollection poems={myPoems} />
    </main>
  );
}
